app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%hey%') ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (name LIKE '%hey%')
---
  def index
    @users = User.paginate(page: params[:page])